{
    "version": "0.6",
    "pageContent":
	{
        "_comments": "JSON object that contains data for page labels, buttons, etc.",
        "navItems":
		{
            "_common":
      			{
                "buttonBackToGallery":
        				{
                    "name": "Back To Gallery",
          					"method": "backToGallery()",
          					"idName": "backToGallery"
                },
                "buttonStartTutorial":
        				{
                    "name": "Start Tutorial",
          					"method": "startTutorialFromDetailsScreen()",
          					"idName": "startTutorial"
                },
        				"buttonViewDetails":
        				{
                    "name": "View Details",
          					"method": "viewDetails()",
          					"idName": "stepsViewDetails"
                }
            }
        }
    },
    "tutorial":
  	{
        "_common":
    		{
            "name": "Tracking Resource Statistics",
            "shortDescription": "Learn how turn on resource statistics tracking and view them in the WebUI.",
            "durationText": "This tutorial takes approximately",
            "durationTime": "15 minutes",
            "_resourceToOpenComment": "The ID of the first resource to open when the user imports the tutorial. Resource IDs are defined in the repo_metadata.json Tutorials listing on ot4i.",
            "resourceToOpen": "EventRoutingFlow",
            "helpLink":
      			{
                "text": "IBM Knowledge Center",
                "link": "/com.ibm.etools.msgbroker.helphome.doc/help_home_msgbroker.htm"
            }
        },
        "pageDetails":
    		{
            "topicsName": "Tutorial Topics",
            "_topicListComment": "A short list of product concepts or tasks demonstrated by this tutorial",
            "topicList":
      			[
                {
                    "title": "Finding and editing the server config file"
                },
                {
                    "title": "Manually enabling resource statistics tracking"
                },
                {
                    "title": "Configuring File In/Output nodes within flows"
                },
                {
                    "title": "Accessing the WebUI"
                },
                {
                    "title": "Monitoring the resource statistics in real-time"
                }
            ],
            "outcomesName": "Learning outcomes",
            "_outcomesComment": "A description of what the user will have learned or accomplished by running this tutorial.",
            "outcomeList":
      			[
                {
                    "title": "Understand how to locate the server config file, turn on resource statistics tracking and monitor them in real time using the WebUI. "
                }
            ],
            "summary":
      			{
                "overviewName": "OVERVIEW",
                "_overviewComment": "A short description of what happens in this tutorial, and an optional short explanation of the IIB concepts used in this tutorial if necessary for context. What background knowledge must the user have for this to make sense?",
                "sections":
        				[
                    {
                        "section": "This tutorial shows how a user would go about enabling resource statistics tracking and then monitor said statistics in real-time. The example uses a pair of message flows which implement transformations and file input/output as the core demonstrative operations."
                    },
                    {
                        "section": "The server.conf.yaml file will be introduced as a useful way for tweaking the behaviour of an integration server. In this example we will only enable resource statistics tracking."
                    },
                    {
                        "section": "The user will then make several requests to the server and then shown the resulting raw and processed files in the server working directory."
                    },
                    {
                        "section": "Finally, they will be guided through accessing the WebUI of the server and how to use it to view various resource statistics. More specifically, the statistics regarding File transferring, processing and output."
                    }
                ]
            },
			"helpLinks":
			{
				"_helpLinksComment": "Helplinks that have a type:web attribute are rendered as web links. Otherwise, links are assumed to be to embedded Help topics in the Knowledge Center.",
				"title": "Find out more",
				"details":
				[
					{
						"title": "Knowledge Center link to ",
						"description": "Developing integration solutions by using applications",
						"link": "com.ibm.etools.mft.doc/bi12002_.htm",
						"type": "help"
					},
					{
						"title": "GitHub link to ",
						"description": "DFDL Schemas",
						"link": "http://github.com/DFDLSchemas",
						"type": "web"
					}
				]
			}
        },
        "pageSteps":
    		{
            "create":
      			{
                "overview":
        				{
                    "name": "Create",
                    "heading": "Import projects",
                    "_createComment": "A description of what will happen when the user clicks Import.",
                    "sections":
          					[
                        {
                            "section": "When you click Import, 2 entities will be created in your workspace: the <span class='application'>ResourceStatsApp</span> application, conatining two message flows, and the <span class='application'>ResourceStatsBar</span> BAR file."
                        },
                  			{
                  			    "section": "The contents of this tutorial will be explained in more detail when you move on to the Prepare tab, along with the setup steps you need to complete before viewing the statistics."
                  			}
                    ]
                },
                "actions":
        				{
                    "title": "Create Actions",
                    "details":
          					[
                        {
                            "name": "Import",
                            "method": "importArtifacts()"
                        }
                    ]
                }
            },
            "prepare":
      			{
                "overview":
        				{
                    "name": "Prepare",
                    "heading": "Prepare an Integration Server",
                    "_prepareComment": "Enable resource statistics tracking:",
                    "sections":
          					[
                      {
                        "steps":
                        {
                          "type": "ordered",
                          "details":
                          [
                            {
                                "details": "Assuming you are using a Windows platform, open an App Connect Enterprise Command Console and create the working directory for our server using the following command: <br><code>mqsicreateworkdir C:\\TESTSERVER</code>"
                            },
                            {
                                "details": "Navigate to this directory and locate the file 'server.conf.yaml'. Open it, uncomment and set the following parameters under Resource to:<br><span class='code'>reportingOn: true<br>outputFormat: 'file'</span><br>Save and close this file."
                            },
                            {
                                "details": "In the ACE Toolkit, open both the message flows in the <span class='application'>ResourceStatsApp</span> Application. Double click on all the 'File Output' nodes and under the Basic tab change the Directory field to the path of your server's working directory. Do the same with the 'Input Directory' field in the 'File Input' node."
                            },
                            {
                                "details": "Start the server using the command:<br><code>IntegrationServer --work-dir C:\\TESTSERVER --name TESTSERVER --admin-rest-api 7600 --http-port-number 7800 --console-log</code><br> in the ACE Command Console and deploy the BAR file in the Application Development Panel."
                            },
                            {
                                "details": "Right click on the server in the Toolkit and launch the WebUI."
                            }
                          ]
                        }
                      },
                      {
                          "section": "Tip: To uncomment something simply remove the preceeding '#', but be careful not to uncomment anything other config parameters!"
                      }
                    ]
                },
                "actions":
        				{
                    "title": "Prepare Actions",
                    "details":
          					[
                        {
                            "name": "Deploy",
                            "method": "deployArtifacts()"
                        }
                    ]
                }
            },
            "run":
      			{
                "overview":
        				{
                    "name": "Run",
                    "heading": "Follow these steps to complete the tutorial",
                    "_runComment": "The full steps for the user to run through the tutorial. Use 'sections' to render paragraphs, 'steps' with a type of 'ordered' or 'unordered' to render HTML lists, and 'substeps' to render nested lists.",
                    "sections":
          					[
                        {
                            "section": "Follow the following steps to complete the tutorial.",
                            "steps":
              							{
                                "type": "ordered",
                                "details":
                								[
                                    {
                                        "details": "Navigate to a Command Prompt, cd to your toolkit's current workspace and run this command: <br><code>curl -X POST http://localhost:7800/fileIn -d @.\\Transformation_ESQL\\input.xml</code>"
                                    },
                                    {
                                        "details": "Assuming the server did not return an error code, open a new Command Prompt and cd to your server's working directory. If you see a file named 'outputRaw', after a short delay this should be replaced by 2 files named 'output.txt' and 'output.xml'. Open these and view to contents if you wish."
                                    },
                                    {
                                        "details": "Open the WebUI for the server."
                                    },
                                    {
                                        "details": "Navigate to the 'Resource Statistics' tab on the navigation bar, then select 'File' on the vertical list."
                        				    },
                        				    {
                                        "details": "After waiting a moment, you should begin to see all the graphs (Files Read, Files Created etc.) begin to rise with direct correlation to the amount of data read processed by the server."
                        				    },
                        				    {
                                        "details": "Try sending a few more of the same curl requests. After waiting a short time the graphs should continue to rise."
                        				    },
                        				    {
                                        "details": "Feel free to browse the other statistics tabs and graphs in your own time."
                          					}
                                ]
                            }
                        }
                    ]
                },
				"exits":
				{
					"title": "Run Exits",
					"details":
					[
						{
							"name": "Clean Up",
							"description": "Clean up and remove any changes in your workspace made by the tutorial.",
							"method": "cleanUp()"
						}
					]
				}
            }
        }
    }
}
